Public Attributes | List of all members
API_GeoLocation Struct Reference
Geolocation
Geo Location data of the project. More...
#include <APIdefs_Environment.h>
 Public Attributes
 API_PlaceInfo  | placeInfo
Project Location settings.
 API_Coord3D  | surveyPointPosition
Position of the Survey Point in the project.
 API_GeoReferenceData  | geoReferenceData
Coordinate Reference System and Map Conversion data.
Detailed Description
Geo Location data of the project.
Since
Archicad 25
Remarks
This structure holds the parameters of the Geo Location settings of the project, such as geographic location, survey point position, and reference map conversion parameters. In Teamwork you can retrieve the guid of this lockable object by using the "GeoLocation" identifier as the parameter of the ACAPI_Teamwork_FindLockableObjectSet function.